In [2]:
import pandas as pd

employee_df = pd.read_csv("employees.csv")
sales_df = pd.read_csv("sales.csv")
product_df = pd.read_csv("product_sales.csv")
customers_df = pd.read_csv("customers.csv")

In [3]:
print(employee_df)

   EmployeeID     Name Department  Salary JoiningDate
0        1001    Alice         HR   48633  2018-01-01
1        1002      Bob         IT   74238  2018-06-30
2        1003  Charlie    Finance   68408  2018-12-27
3        1004    David         IT   70512  2019-06-25
4        1005      Eva         HR   70051  2019-12-22
5        1006    Frank  Marketing   64278  2020-06-19
6        1007    Grace    Finance   46296  2020-12-16
7        1008    Helen         IT   44599  2021-06-14
8        1009      Ian  Marketing   89204  2021-12-11
9        1010     Jack         HR   89438  2022-06-09

In [4]:
print(sales_df)

    SaleID  Product Region SalesPerson   Amount        Date
0        1   Laptop  South       Frank  1129.58  2023-01-01
1        2    Phone  North     Charlie   630.00  2023-01-16
2        3   Tablet   East        Jack   428.12  2023-01-31
3        4   Laptop  North       Alice  1360.84  2023-02-15
4        5    Phone  North        Jack   870.96  2023-03-02
5        6  Monitor   West       Frank  1410.26  2023-03-17
6        7   Laptop  South       Grace   727.90  2023-04-01
7        8    Phone   West        Jack   239.40  2023-04-16
8        9   Tablet  South       Grace   470.17  2023-05-01
9       10    Phone   West         Ian   414.57  2023-05-16
10      11    Phone  North       Alice   781.42  2023-05-31
11      12   Tablet   East     Charlie   566.21  2023-06-15
12      13   Tablet   East       Helen   576.56  2023-06-30
13      14    Phone   West       David   742.15  2023-07-15
14      15   Tablet  South     Charlie   509.13  2023-07-30
15      16   Tablet  North       Frank   660.26  2023-08-14
16      17   Tablet  North         Ian   403.15  2023-08-29
17      18   Tablet  South       Helen   605.16  2023-09-13
18      19  Monitor   East       Helen  1411.91  2023-09-28
19      20   Tablet   East         Eva   710.15  2023-10-13

In [5]:
print(product_df)

   Product_1  Product_2  Product_3  Product_4  Product_5  Product_6
0         25         70         41         87        196        188
1        103        165        159         78         88         69
2        155        161         36        121        196        113
3        130        103         77        185         51         62
4         50         49         38         27        160         76
5        121         38        163         41        117        149
6         64        194         47        182        180         86
7        114        128        169        136         43         36
8        151        105         93         60        166        192
9         29        163        162         89         40         26

In [6]:
print(customers_df)

   CustomerID    Name       City  Age  Gender
0         501     Tom     Mumbai   30    Male
1         502   Jerry  Bangalore   42  Female
2         503    Anna  Bangalore   22    Male
3         504    Sara    Chennai   54  Female
4         505    Mike      Delhi   24  Female
5         506   Linda     Mumbai   21  Female
6         507   Steve      Delhi   20  Female
7         508  Rachel     Mumbai   54  Female
8         509    Ryan      Delhi   29    Male
9         510    Nina     Mumbai   24  Female

In [12]:
employee_df.shape
print(sales_df.shape)
print(product_df.shape)
print(customers_df.shape)

(20, 6)
(10, 6)
(10, 5)

In [16]:
print(employee_df.columns)
print(sales_df.columns)
print(product_df.columns)
print(customers_df.columns)

Index(['EmployeeID', 'Name', 'Department', 'Salary', 'JoiningDate'], dtype='object')
Index(['SaleID', 'Product', 'Region', 'SalesPerson', 'Amount', 'Date'], dtype='object')
Index(['Product_1', 'Product_2', 'Product_3', 'Product_4', 'Product_5',
       'Product_6'],
      dtype='object')
Index(['CustomerID', 'Name', 'City', 'Age', 'Gender'], dtype='object')

In [20]:
print(employee_df.dtypes)
print(sales_df.dtypes)
print(product_df.dtypes)
print(customers_df.dtypes)

EmployeeID      int64
Name           object
Department     object
Salary          int64
JoiningDate    object
dtype: object
SaleID           int64
Product         object
Region          object
SalesPerson     object
Amount         float64
Date            object
dtype: object
Product_1    int64
Product_2    int64
Product_3    int64
Product_4    int64
Product_5    int64
Product_6    int64
dtype: object
CustomerID     int64
Name          object
City          object
Age            int64
Gender        object
dtype: object

In [22]:
print("First 3 row :\n",employee_df.head(3))
print("Last 3 row :\n", employee_df.tail(3))

First 3 row :
    EmployeeID     Name Department  Salary JoiningDate
0        1001    Alice         HR   48633  2018-01-01
1        1002      Bob         IT   74238  2018-06-30
2        1003  Charlie    Finance   68408  2018-12-27
Last 3 row :
    EmployeeID   Name Department  Salary JoiningDate
7        1008  Helen         IT   44599  2021-06-14
8        1009    Ian  Marketing   89204  2021-12-11
9        1010   Jack         HR   89438  2022-06-09

In [ ]:
employee_df.notnull()

   EmployeeID  Name  Department  Salary  JoiningDate
0        True  True        True    True         True
1        True  True        True    True         True
2        True  True        True    True         True
3        True  True        True    True         True
4        True  True        True    True         True
5        True  True        True    True         True
6        True  True        True    True         True
7        True  True        True    True         True
8        True  True        True    True         True
9        True  True        True    True         True

In [25]:
print(employee_df.isnull().sum())

EmployeeID     0
Name           0
Department     0
Salary         0
JoiningDate    0
dtype: int64

In [26]:
print(sales_df.isnull().sum())

SaleID         0
Product        0
Region         0
SalesPerson    0
Amount         0
Date           0
dtype: int64

In [27]:
print(product_df.isnull().sum())

Product_1    0
Product_2    0
Product_3    0
Product_4    0
Product_5    0
Product_6    0
dtype: int64

In [28]:
print(customers_df.isnull().sum())

CustomerID    0
Name          0
City          0
Age           0
Gender        0
dtype: int64

In [33]:
print(employee_df.duplicated().sum())
print(sales_df.duplicated().sum())
print(product_df.duplicated().sum())
print(customers_df.drop_duplicates())

0
0
0
   CustomerID    Name       City  Age  Gender
0         501     Tom     Mumbai   30    Male
1         502   Jerry  Bangalore   42  Female
2         503    Anna  Bangalore   22    Male
3         504    Sara    Chennai   54  Female
4         505    Mike      Delhi   24  Female
5         506   Linda     Mumbai   21  Female
6         507   Steve      Delhi   20  Female
7         508  Rachel     Mumbai   54  Female
8         509    Ryan      Delhi   29    Male
9         510    Nina     Mumbai   24  Female

In [38]:
print(employee_df.columns)
print("Rename the employeee name")

print(employee_df.rename(columns={'Name' : 'Employee_Name'}, inplace=True))

Index(['EmployeeID', 'Name', 'Department', 'Salary', 'JoiningDate'], dtype='object')
Rename the employeee name
None

In [39]:
print(employee_df)

   EmployeeID Employee_Name Department  Salary JoiningDate
0        1001         Alice         HR   48633  2018-01-01
1        1002           Bob         IT   74238  2018-06-30
2        1003       Charlie    Finance   68408  2018-12-27
3        1004         David         IT   70512  2019-06-25
4        1005           Eva         HR   70051  2019-12-22
5        1006         Frank  Marketing   64278  2020-06-19
6        1007         Grace    Finance   46296  2020-12-16
7        1008         Helen         IT   44599  2021-06-14
8        1009           Ian  Marketing   89204  2021-12-11
9        1010          Jack         HR   89438  2022-06-09

In [40]:
it_employee = employee_df[employee_df["Department"]=="IT"]
print(it_employee)

   EmployeeID Employee_Name Department  Salary JoiningDate
1        1002           Bob         IT   74238  2018-06-30
3        1004         David         IT   70512  2019-06-25
7        1008         Helen         IT   44599  2021-06-14

In [41]:
HR_employee = employee_df[employee_df["Department"]== "HR"]
print(HR_employee)

   EmployeeID Employee_Name Department  Salary JoiningDate
0        1001         Alice         HR   48633  2018-01-01
4        1005           Eva         HR   70051  2019-12-22
9        1010          Jack         HR   89438  2022-06-09

In [42]:
mrkt_employee = employee_df[employee_df["Department"] == "Marketing"]
print(mrkt_employee)

   EmployeeID Employee_Name Department  Salary JoiningDate
5        1006         Frank  Marketing   64278  2020-06-19
8        1009           Ian  Marketing   89204  2021-12-11

In [43]:
fin_employee= employee_df[employee_df["Department"] == "Finance"]
print(fin_employee)

   EmployeeID Employee_Name Department  Salary JoiningDate
2        1003       Charlie    Finance   68408  2018-12-27
6        1007         Grace    Finance   46296  2020-12-16

In [44]:
print(sales_df)

    SaleID  Product Region SalesPerson   Amount        Date
0        1   Laptop  South       Frank  1129.58  2023-01-01
1        2    Phone  North     Charlie   630.00  2023-01-16
2        3   Tablet   East        Jack   428.12  2023-01-31
3        4   Laptop  North       Alice  1360.84  2023-02-15
4        5    Phone  North        Jack   870.96  2023-03-02
5        6  Monitor   West       Frank  1410.26  2023-03-17
6        7   Laptop  South       Grace   727.90  2023-04-01
7        8    Phone   West        Jack   239.40  2023-04-16
8        9   Tablet  South       Grace   470.17  2023-05-01
9       10    Phone   West         Ian   414.57  2023-05-16
10      11    Phone  North       Alice   781.42  2023-05-31
11      12   Tablet   East     Charlie   566.21  2023-06-15
12      13   Tablet   East       Helen   576.56  2023-06-30
13      14    Phone   West       David   742.15  2023-07-15
14      15   Tablet  South     Charlie   509.13  2023-07-30
15      16   Tablet  North       Frank   660.26  2023-08-14
16      17   Tablet  North         Ian   403.15  2023-08-29
17      18   Tablet  South       Helen   605.16  2023-09-13
18      19  Monitor   East       Helen  1411.91  2023-09-28
19      20   Tablet   East         Eva   710.15  2023-10-13

In [45]:
print(sales_df[sales_df["Amount"] > 1000])

    SaleID  Product Region SalesPerson   Amount        Date
0        1   Laptop  South       Frank  1129.58  2023-01-01
3        4   Laptop  North       Alice  1360.84  2023-02-15
5        6  Monitor   West       Frank  1410.26  2023-03-17
18      19  Monitor   East       Helen  1411.91  2023-09-28

In [46]:
print(customers_df)

   CustomerID    Name       City  Age  Gender
0         501     Tom     Mumbai   30    Male
1         502   Jerry  Bangalore   42  Female
2         503    Anna  Bangalore   22    Male
3         504    Sara    Chennai   54  Female
4         505    Mike      Delhi   24  Female
5         506   Linda     Mumbai   21  Female
6         507   Steve      Delhi   20  Female
7         508  Rachel     Mumbai   54  Female
8         509    Ryan      Delhi   29    Male
9         510    Nina     Mumbai   24  Female

In [49]:
young_customers = customers_df[
    (customers_df['City'].isin(["Delhi", "Mumbai"])) &
    (customers_df["Age"] < 30)
]

print(young_customers)

   CustomerID   Name    City  Age  Gender
4         505   Mike   Delhi   24  Female
5         506  Linda  Mumbai   21  Female
6         507  Steve   Delhi   20  Female
8         509   Ryan   Delhi   29    Male
9         510   Nina  Mumbai   24  Female